Tekla Open API Reference for Tekla Structures 2025
TransformationPlane Constructor (Point, Vector, Vector)
 Creates a new transformation plane defined by the given origin and two vectors.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public TransformationPlane(
	Point Origo,
	Vector Xvector,
	Vector Yvector
)
Public Sub New (
	Origo As Point,
	Xvector As Vector,
	Yvector As Vector
)
Parameters
Origo
Type: Tekla.Structures.Geometry3d.Point
The origin to be used.
Xvector
Type: Tekla.Structures.Geometry3d.Vector
The X vector to be used.
Yvector
Type: Tekla.Structures.Geometry3d.Vector
The Y vector to be used.
See Also
Reference
TransformationPlane Class
TransformationPlane Overload
Tekla.Structures.Model Namespace